import MiniAccordionList from "@/features/UI/Accordion";
const MiniAccordion = [
  {
    question: "چگونه می‌توانم اتاق رزرو کنم؟",
    answer:
      "کافیست تاریخ ورود و خروج و تعداد مهمانان را مشخص کنید تا اتاق‌های موجود نمایش داده شوند. پس از انتخاب اتاق، با ورود به حساب کاربری و پرداخت آنلاین، رزرو شما نهایی می‌شود.",
  },
  {
    question: "چرا خوردن غذا و نوشیدنی در محل اسکان ممنوع است؟",
    answer:
      "قوانین کنسلی بسته به نوع اتاق و زمان درخواست متفاوت است. شما می‌توانید از طریق پنل کاربری خود درخواست کنسلی را ثبت کنید.",
  },
  {
    question: "سرویس‌های بهداشتی و حمام کجا قرار دارند؟",
    answer:
      "بله، تمامی رزروهای هتل ساحلی موجان شامل بوفه صبحانه رایگان برای مهمانان مقیم می‌باشد.",
  },
  {
    question: "آیا امکان استفاده از اینترنت (Wi-Fi) وجود دارد؟",
    answer:
      "بله، تمامی رزروهای هتل ساحلی موجان شامل بوفه صبحانه رایگان برای مهمانان مقیم می‌باشد.",
  },
  {
    question: "برنامه غذا و پذیرایی چگونه اطلاع‌رسانی می‌شود؟",
    answer:
      "بله، تمامی رزروهای هتل ساحلی موجان شامل بوفه صبحانه رایگان برای مهمانان مقیم می‌باشد.",
  },
  {
    question: "چگونه می‌توان خادم موکب شد؟",
    answer:
      "بله، تمامی رزروهای هتل ساحلی موجان شامل بوفه صبحانه رایگان برای مهمانان مقیم می‌باشد.",
  },
  {
    question: "برای رفت‌وآمد به حرم چه راهنمایی وجود دارد؟",
    answer:
      "بله، تمامی رزروهای هتل ساحلی موجان شامل بوفه صبحانه رایگان برای مهمانان مقیم می‌باشد.",
  },
  {
    question: "چگونه می‌توان نذورات و کمک‌های مردمی را به موکب اهدا کرد؟",
    answer:
      ".",
  },
];
function FAQ() {
  return (
    <div className="w-full min-h-[480px] h-auto py-12 lg:py-0 rounded-3xl flex flex-col lg:flex-row justify-between items-center gap-8 px-6 lg:px-16 overflow-hidden">


      <div className="w-full ">
        <MiniAccordionList items={MiniAccordion}/>
      </div>
    </div>
  );
}

export default FAQ;
